Настройка коммутатора DCN

1) Подключение к коммутатору. - через Console (sudo screen -r -d  разверуть скрин) - через telnet
	
	/usr/bin/sudo usr/bin/screen /dev/ttyUSB0 9600 
	telnet 192.168.X.X 

2) Посмотреть: Vlan MAC, SoftWare Version.

	show version

3) Копируем папку с прошивкаи из репозитория GitHub в корневую папку TFTP-сервервера (переименовываем в NOS).

	cp -r 3900/ /var/lib/tftpbooot/nos

4) Посмотреть файлы прошивки nos.img и стартап-конфигурации startup.cfg.

	dir

5) TFTP - с Компа на Коммутатор. C корневой папки TFTP-сервера "/var/lib/tftpbooot".
(Коммутатор должен быть подключен либо патчкордом либо по телнету, iP-задан от локальный либо интернет сетевой карты.)

	copy tftp://192.168.254.132/nos/S3900-342.img nos.img
	copy tftp://192.168.254.132/conf/3900-28.cfg copy startup.cfg

	write - записать из оперативки в startup.cfg
	reload - перезагрузить коммутатор.

6) TFTP - с Коммутатора на Комп. В корневую папку TFTP-сервера "/var/lib/tftpbooot"
(Коммутатор должен быть подключен либо патчкордом либо по телнету, iP-задан от локальный либо сетевой)

	copy startup.cfg tftp://192.168.254.132/conf/3900-10Pttttt.cfg

7) TFTP команда для копирования ФАЙЛОВ в корневой каталог tftp с диска.

	$ tftp localhost - вызов командной строки tftp
	tftp> put /home/evgenii/git_Hub/repo_IIF/eltex/ФАЙЛ.cfg имя_в_корневом каталоге - положить из репо в tftpboot.
	Ctrl + Z - выход.

8) Работа с vlan

	vlan 4094 (несколько 172;173, диапазон 172-175)        - создать vlan(Ы).
	exit                                                   - выйти.

Акцессный порт
	Interface Ethernet1/0/2 (несколько ;3;4, диапазон 5-7) - заходим в конфигурирование портов.
	switchport mode hybrid                                 - выбераем режим порта.
	switchport hybrid allowed vlan 172-175 tag             - пропускаем служебные vlans
	switchport hybrid allowed vlan 4094 untag              - пропускаем нетегированный vlan
	switchport hybrid native vlan 4094                     - далаем vlan нативным

UPLINK порт (порт в сторону вышестоящего коммутатора от которого получаем интернет)
	Interface Ethernet1/0/2                                - заходим в конфигурирование портов.
	switchport mode hybrid                                 - выбераем режим порта.
	switchport hybrid allowed vlan 172-175 tag             - пропускаем служебные vlans

9) Задать IP адресс на vlan и шлюз по умолчанию.

	interface vlan 172                                     - заходим в конфигурацию интерфейса	
        ip address 172.16.105.143 255.255.255.0                - задаем IP адрес для vlan172
	ip default-gateway 172.16.105.254                      - шлюз по умолчанию

*) Пример настройки скорости Ethernet интерфейса

	Перевод SFP интерфейса в режиме 100BaseX (100mb/s)
	SNR-S2985G-24T#conf
	SNR-S2985G-24T(config)#interface ethernet 1/0/25
	SNR-S2985G-24T(config-if-ethernet1/0/25)#speed-duplex force100-fx

	Настройка автоопределения скорости 10/100 mb/s, duplex auto на гигабитном интерфейсе
	SNR-S2985G-24T#conf
	SNR-S2985G-24T(config)#interface ethernet 1/0/24
	SNR-S2985G-24T(config-if-ethernet1/0/24)#speed-duplex auto 10 100 auto
	
	Перевод интерфейса 1/0/1 в режим 100 мб/c full-duplex
	SNR-S2985G-24T#conf
	SNR-S2985G-24T(config)#interface ethernet 1/0/1
	SNR-S2985G-24T(config-if-ethernet1/0/1)#speed-duplex force100-full
	
	Возврат настроек интерфейса к значению по умолчанию (автоматическое согласование скорости/дуплекса)
	SNR-S2985G-24T(config-if-ethernet1/0/1)#no speed-duplex

	
